Repository: tau-OS/accelerator
Catalog: po/*.po
Languages: fi, th

source: Accelerator
fi: Kiihdytin

source: Terminal
fi: Pääte
th: เทอร์มินัล

source: Terminal;terminal;shell;prompt;command;commandline;cmd;box;
fi: Pääte;pääte;komentorivi;kehote;komento;komentorivi;komento;laatikko;
th: Terminal;terminal;shell;prompt;command;commandline;cmd;box;เทอร์มินัล;คำสั่ง;

source: Window width
fi: Ikkunan leveys
th: ความกว้างหน้าต่าง

source: Window height
fi: Ikkunan korkeus
th: ความยาวหน้าต่าง

source: Whether or not to display borders around the window and tabs
fi: Näytetäänkö reunat ikkunan ja välilehtien ympärillä
th: แสดงกรอบรอบหน้าต่างและแท็บ

source: Whether or not to remember window size
fi: Muistetaanko ikkunan koko
th: ควรจำขนาดหน้าต่างหรือไม่

source: Font family and size
fi: Fonttiperhe ja -koko
th: ชุดแบบอักษรและขนาด

source: Whether the window should inherit terminal theme's colors
fi: Tuleeko ikkunan käyttää päätteen teemavärejä
th: ควรตั้งสีหน้าต่างให้ตรงกับสีเทอร์มินัลหรือไม่

source: Terminal window background opacity
fi: Pääteikkunan taustan läpikuultavuus
th: ความทึบของพื้นหลังหน้าต่าง

source: Whether or not tabs should expand to fill tab bar
fi: Levitetäänkö välilehdet täyttämään välilehtipalkki
th: ควรขยายแท็บจนเต็มแท็บบาร์หรือไม่

source: Whether the headerbar should be shown or not
fi: Näytetäänkö otsakepalkki
th: ควรแสดงแถบส่วนหัวหรือไม่

source: Whether or not to display a menu button in the headerbar
fi: Näytetäänkö valikkopainike otsikkopalkissa
th: ควรแสดงปุ่มเมนูในแถบส่วนหัวหรือไม่

source: Whether or not to draw a 1px line under the header bar when there's a single tab open
fi: Piirretäänkö otsikkorivin alle 1 kuvapisteen viiva, kun yksi välilehti on auki
th: ควรแสดงเส้นความหนา 1px ใต้แถบส่วนหัวหรือไม่เมื่อเปิดแค่แท็บเดียว

source: Whether or not to reserve an area for dragging the header bar
fi: Varataanko alue otsikkopalkin raahaamista varten
th: ควรเผื่อพื้นที่สำหรับลากแถบส่วนหัวหรือไม่

source: Whether or not to show scrollbars
fi: Näytetäänkö selauspalkit
th: ควรแสดงแถบเลื่อนหรือไม่

source: Whether overlay scrolling should be enabled
fi: Pitääkö peittokuvan vieritys olla käytössä
th: ควรเปิดใช้งานแถบเลื่อนลอยทับหรือไม่

source: If enabled, terminals will scroll by pixels instead of rows
fi: Jos käytössä, päätteet vierivät pikselien mukaan rivien sijaan
th: ถ้าเปิด เทอร์มินัลจะเลื่อนตามพิกเซลแทนแถว

source: If enabled, terminals will render sixel escape sequences
fi: Jos otettu käyttöön, päätteet renderöi sixel escape -sekvenssit
th: ถ้าเปิด เทอร์มินัลจะแสดงผลอักขระพิเศษ Sixel

source: Scrollback mode
fi: Selaus tila
th: โหมดย้อนหลัง

source: Number of lines stored in scrollback
fi: Selattavien rivien enimmäismäärä
th: จำนวนบรรทัดที่บันทึกย้อนหลัง

source: If enabled, floating controls will be shown in headerless mode
fi: Jos käytössä, kelluvat säätimet näytetään otsikottomassa tilassa
th: ถ้าเปิด การควบคุมแบบลอยตัวจะแสดงในโหมดไม่มีส่วนหัว

source: Hoverable area (in pixels) at the top of the window to trigger floating controls
fi: Alue (pikseleinä) ikkunan yläreunassa, jolla ikkunan kellutustoiminnot aktivoituvat
th: พื้นที่ที่สามารถวางเคอร์เซอร์ลอยได้ (เป็นพิกเซล) ที่ด้านบนของหน้าต่างเพื่อทริกเกอร์การควบคุมแบบลอย

source: Delay time before showing floating controls
fi: Viipe ennen kellutustoimintojen näyttämistä
th: หน่วงเวลาก่อนที่จะแสดงส่วนควบคุมแบบลอย

source: The light color scheme for the terminal
fi: Vaalea väriasu päätteelle
th: ธีมโหมดสว่างสำหรับเทอร์มินัล

source: The dark color scheme for the terminal
fi: Tumma väriasu päätteelle
th: ธีมโหมดมืดสำหรับเทอร์มินัล

source: Style preference
fi: Tyyli etusija
th: รูปแบบสี

source: Amount of padding around terminal widgets (top, right, bottom, left)
fi: Pääte widgettejen toppauksen määrä (päällä, oikealla, alla, vasamalla)
th: จำนวนช่องว่างภายในวิดเจ็ตเทอร์มินัล (บน, ขวา, ล่าง, ซ้าย)

source: Terminal cell width
fi: Päätesolun leveys
th: ความกว้างเทอร์มินัลตามเซลล์

source: Terminal cell height
fi: Päätesolun korkeus
th: ความยาวเทอร์มินัลตามเซลล์

source: Cursor shape
fi: Kursori muoto
th: รูปแบบเคอร์เซอร์

source: Whether or not the cursor should blink
fi: Kursorin vilkkuminen
th: ควรที่จะให้เคอร์เซอร์กระพิบหรือไม่

source: If enabled, ctrl+c and ctrl+v will work for copy/paste
fi: Jos käytössä, ctrl+c ja ctrl+v toimivat kopioinnissa/liittämisessä
th: ถ้าเปิดใช้งาน การกด ctrl+c และ ctrl+v จะทำให้คัดลอก/วางได้

source: If enabled, the tab bar will be replaced with a title label when there's a single open tab
fi: Korvaa välilehtipalkki otsakkeella, kun vain yksi avoin välilehti
th: หากเปิดใช้งาน แถบแท็บจะถูกแทนที่ด้วยป้ายชื่อเมื่อเปิดอยู่เพียงแท็บเดียว

source: If enabled, a single open tab will blend with the headerbar color
fi: Yksittäisen välilehden sulautuminen otsikon väriin

source: Whether to spawn shell in login mode
fi: Käynnistetäänkö komentotulkki kirjautumistilassa
th: ควรที่จะเปิดเชลล์ในโหมดล็อกอิน

source: Whether to use a custom command instead of the user's shell
fi: Korvaa käyttäjän komentotulkki
th: ควรที่จะเปิดเชลล์ในโหมดล็อกอินหรือไม่

source: Custom command to use instead of the user's shell
fi: Mukautettu komentotulkki
th: คำสั่งที่จะใช้แทนเชลล์ของผู้ใช้

source: Whether clicking next on the last search result should return to the first
fi: Viimeisen hakutuloksen jälkeen palaa ensimmäiseen
th: ควรที่จะย้อนไปผลลัพธ์แรกเมื่อกดถัดไปในผลลัพธ์สุดท้ายหรือไม่

source: Whether search should be case sensitive
fi: Merkkikokoriippuvaisuus
th: ควรที่จะให้การค้นหานับพิมพ์เล็ก-ใหญ่หรือไม่

source: Whether search should only match entire words
fi: Etsi vain kokonaisia sanoja
th: ควรที่จะให้การค้นหาจับคู่ทั้งคำเท่านั้นหรือไม่

source: Whether search should be performed using regular expressions
fi: Käytetäänkö säännöllisiä lausekkeita (regex)
th: ควรที่จะค้นหาโดยใช้นิพจน์ปรกติหรือไม่

source: Find
fi: Etsi
th: ค้นหา

source: Previous result
fi: Edellinen tulos
th: ผลลัพธ์ก่อนหน้า

source: Next result
fi: Seuraava
th: ผลลัพธ์ต่อไป

source: Search wraps around
fi: Kiertävä haku
th: วนการค้นหา

source: Match is case sensitive
fi: Tulos on kirjainmerkkikokoriippuvainen
th: พิมพ์เล็ก-พิมพ์ใหญ่มีผลต่อการจับคู่

source: Match entire words only
fi: Vain kokonaiset sanat
th: จับคู่ทั้งคำเท่านั้น

source: Match using regular expression
fi: Käytä säännöllisiä lausekkeita (regex)
th: จับคู่โดยใช้นิพจน์ปรกติ (Regular Expression)

# shortcut window
source: Window
fi: Ikkuna
th: หน้าต่าง

# shortcut window
source: New window
fi: Uusi ikkuna
th: หน้าต่างใหม่

# shortcut window
source: New tab
fi: Uusi välilehti
th: แท็บใหม่

# shortcut window
source: Close tab
fi: Sulje välilehti
th: ปิดแท็บ

# shortcut window
source: Switch headbar mode
fi: Vaihda otsakkeen tilaa
th: สลับโหมด Headbar

# shortcut window
source: Toggle fullscreen
fi: Koko näytön tila
th: สลับเต็มจอ

# shortcut window
source: Terminal
fi: Pääte
th: เทอร์มินัล

# shortcut window
source: Search
fi: Etsi
th: ค้นหา

# shortcut window
source: Copy
fi: Kopioi
th: คัดลอก

# shortcut window
source: Paste
fi: Liitä
th: วาง

# shortcut window
source: Zoom in
fi: Suurenna
th: ซูมเข้า

# shortcut window
source: Zoom out
fi: Pienennä
th: ซูมออก

# shortcut window
source: Navigation
fi: Navigoi

# shortcut window
source: Focus next tab
fi: Valitse seuraava välilehti
th: โฟกัสแท็บต่อไป

# shortcut window
source: Focus previous tab
fi: Valitse edellinen välilehti
th: โฟกัสแท็บก่อนหน้า

# shortcut window
source: Switch to Tab 1
fi: Siirry välilehteen 1
th: เปิดแท็บ 1

# shortcut window
source: Switch to Tab 2
fi: Siirry välilehteen 2
th: เปิดแท็บ 2

# shortcut window
source: Switch to Tab 3
fi: Siirry välilehteen 3
th: เปิดแท็บ 3

# shortcut window
source: Switch to Tab 4
fi: Siirry välilehteen 4
th: เปิดแท็บ 4

# shortcut window
source: Switch to Tab 5
fi: Siirry välilehteen 5
th: เปิดแท็บ 5

# shortcut window
source: Switch to Tab 6
fi: Siirry välilehteen 6
th: เปิดแท็บ 6

# shortcut window
source: Switch to Tab 7
fi: Siirry välilehteen 7
th: เปิดแท็บ 7

# shortcut window
source: Switch to Tab 8
fi: Siirry välilehteen 8
th: เปิดแท็บ 8

# shortcut window
source: Switch to Tab 9
fi: Siirry välilehteen 9
th: เปิดแท็บ 9

# shortcut window
source: Switch to last Tab
fi: Siirry viimeiseen välilehteen
th: เปิดแท็บที่แล้ว

# shortcut window
source: General
fi: Yleinen
th: ทั่วไป

# shortcut window
source: Show Shortcuts
fi: Näytä näppäinoikotiet
th: แสดงคีย์ลัด

source: Edit Shortcut
fi: Muokkaa näppäinoikotietä
th: แก้ใขคีย์ลัด

source: Cancel
fi: Peruuta
th: ยกเลิก

source: Apply
fi: Toteuta
th: ใช้ค่า

source: This shortcut is already in use
fi: Näppäinoikotie on jo käytössä
th: คีย์ลัดนี้มีใช้อยู่แล้ว

source: Press Escape to cancel or Backspace to disable shortcut
fi: Paina Esc peruuttaaksesi tai askelpalautinta poistaaksesi näppäinoikotien
th: กดคีย์ Escape เพิ่อยกเลิก หรือกด Backspace เพิ่อปิดคีย์ลัด

source: Keyboard
fi: Näppäimistö
th: คีย์บอร์ด

source: Shortcuts
fi: Oikotiet
th: คีย์ลัด

source: General
fi: Yleistä
th: ทั่วไป

source: Window
fi: Ikkuna
th: หน้าต่าง

source: Remember Window Size
fi: Muista ikkunan koko
th: จำขนาดหน้าต่าง

source: Show Borders
fi: Näytä reunat
th: แสดงขอบหน้าต่าง

source: Enable to draw a border around the window and the active tab.
fi: Piirrä reunat ikkunan ja aktiivisen välilehden ympärille.
th: เปิดใช้งานเพื่อวาดเส้นขอบรอบหน้าต่างและแท็บที่ใช้งานอยู่

source: Theme Integration
fi: Teeman integrointi
th: ผสมกับธีม

source: Style window with terminal theme colors.
fi: Ikkunan tyyli noudattaa päätteen värejä.

source: Style Preference
fi: Tyyli asetykset

source: Follow System
fi: Seuraa järjestelmää
th: ตามระบบ

source: Light Style
fi: Valoisa tyyli
th: โหมดสว่าง

source: Dark Style
fi: Tumma tyyli
th: โหมดมืด

source: Tabs
fi: Välilehdet
th: แท็บ

source: Expand Tabs
fi: Laajenna välilehdet
th: ขยายแท็บ

source: Single Tab Mode
fi: Yhden välilehden tila
th: โหมดแท็บเดียว

source: Hide Single Tab
fi: Piilota yksittäinen välilehti
th: ซ่อนแท็บเดียว

source: Replace tab bar with a title label when a single tab is open. Easier to drag the window.
fi: Korvaa välilehtipalkki otsikolla, kun vain yksi välilehti auki. Helpottaa ikkunan raahaamista.

source: Stealth Single Tab
fi: Yksityinen yksittäinen välilehti

source: Blend single tab with header bar.
fi: Yhdistä yksittäinen välilehti otsikkopalkkiin.

source: Header Bar
fi: Otsikkopalkki

source: Show Header Bar
fi: Näytä otsikkopalkki

source: Show Menu Button
fi: Näytä valikkopainike

source: Drag Area
fi: Raahausalue

source: Enable to reserve some space on the left side to drag the window.
fi: Ota käyttöön varataksesi tilaa raahataksesi ikkunaa vasemmalta.

source: Draw Line Under Header Bar
fi: Piirrä viiva otsikkopalkin alle

source: Enable to draw a line under the header bar when a single tab is open. Requires "Show Borders".
fi: Ota käyttöön piirtääksesi viivan otsikkopalkin alle, kun yksittäinen välilehti on auki. Vaatii "Näytä reunat" päälle.

source: Floating Controls
fi: Kelluvuus asetukset

source: Show Floating Controls
fi: Näytä kelluvuusohjaimet

source: Show floating controls when header bar is hidden.
fi: Näytä kelluvuudenohjaimet, kun otsikkopalkki on piilotettu.

source: Floating Controls Hover Area
fi: Kellutustoimintojen aktivoitumisala

source: Hoverable area (in pixels) at the top of the window to trigger floating controls.
fi: Ala (pikseleinä) ikkunan yläreunassa jolla kellutustoiminnot aktivoidaan.

source: Delay Before Show Floating Controls
fi: Viipe ennen kellutustoimintojen näyttämistä

source: Delay time (ms) before show floating controls.
fi: Viipe (ms) ennen kellutustoimintojen näyttämistä.

source: Text
fi: Teksti
th: ข้อความ

source: Font
fi: Fontti
th: ฟอนต์

source: Cell Spacing
fi: Solujen väli

source: Width
fi: Leveys
th: ความกว้าง

source: Height
fi: Korkeus
th: ความยาว

source: Easy Copy &amp; Paste
fi: Helppo kopioi ja liitä
th: คัดลอกและวางแบบเรียบง่าย

source: Use ctrl+c/ctrl+v for copy/paste.
fi: Käytä ctrl+c/ctrl+v kopioidaksesi ja liittääksesi.
th: ใช้ ctrl+c/ctrl+v เพื่อคัดลอก วาง

source: Cursor Shape
fi: Kursorin muoto
th: รูปแบบเคอร์เซอร์

source: Block
fi: Palikka
th: บล็อก

source: IBeam
fi: I-palkki
th: รูปตัวไอ

source: Underline
fi: Alleviivaa
th: ขีดเส้นใต้

source: Cursor Blinking
fi: Osoittimen vikkuminen
th: กะพริบเคอร์เซอร์

source: Whether or not the cursor should blink.
fi: Vilkkuuko osoitin vai ei.

source: On
fi: Päälle
th: เปิด

source: Off
fi: Pois
th: ปิด

source: Padding
fi: Sisennys

source: Opacity
fi: Läpinäkyvyys

source: Terminal background opacity.
fi: Päätteen taustan läpinäkyvyys.

source: Scrolling
fi: Vieritys

source: Scrollbars
fi: Vierityspalkit

source: Show Scrollbars
fi: Näytä vierityspalkit

source: Use Overlay Scrolling
fi: Käytä piilotettua vierityspalkkia

source: Fixed Size
fi: Kiinteä koko
th: กำหนดขนาด

source: Unlimited
fi: Rajoittamaton
th: ไม่จำกัด

source: Disabled
fi: Pois käytöstä
th: ปิด

source: Scrollback Lines
fi: Vieritettävät rivit
th: บรรทัดที่บันทึกย้อนหลัง

source: Command
fi: Komento
th: คำสั่ง

source: Run Command as Login Shell
fi: Aja komento kirjautumiskomentokehotteena

source: Use Custom Command
fi: Käytä mukautettua komentoa

source: Custom Command
fi: Mukautettu komento

source: Theme
fi: Teema
th: ธีม

source: Open folder
fi: Avaa kansio

source: Get more themes online
fi: Hanki lisää teemoja verkosta

source: Set your preferred theme for light and dark styles.
fi: Aseta haluamasi teema vaalealle ja tummalle tyylille.

source: Light Theme
fi: Vaalea teema
th: ธีมสว่าง

source: Dark Theme
fi: Tumma teema
th: ธีมมืด

source: Only display themes for the current style
fi: Näytä vain nykyisen tyylin teemat

source: To ensure readability, "Theme Integration" will be disabled if you select a light color scheme while using the dark app style or a dark color scheme while using the light app style.
fi: Varmistakseen luettavuuden, "Teeman integrointi" kytketään pois, jos vaalea värimaailma valitaan, kun tumma sovellustyyli on käytössä tai tumma värimaailma valitaan vaalealla sovellustyylillä.

source: Advanced
fi: Edistynyt

source: Experimental
fi: Kokeellinen

source: Features in this section are known to be wonky. Please feel free to test and <a href="https://gitlab.gnome.org/raggesilver/blackbox/-/issues">report bugs</a>.
fi: Tämän osion toiminnot eivät ole vakaita. Kokeile ja <a href="https://gitlab.gnome.org/raggesilver/blackbox/-/issues">ilmoita viallinen toiminto</a>.

source: Sixel Support
fi: Sixel tuki

source: Render sixel escape sequences.
fi: Renderöi sixel erikoismerkit.

source: Danger Zone
fi: Vaaravyöhyke

source: Reset Preferences
fi: Alusta asetukset

source: This will revert all settings back to default. Your extra themes will not be removed.
fi: Tämä palauttaa asetukset oletusarvoihin. Lisäteemat eivät poistu.

source: Reset preferences
fi: Palauta asetukset

source: You can still access the menu by right-clicking any terminal.
fi: Pääset edelleen valikkoon painamalla päätteessä hiiren oikealla.

source: %s uses an early Gtk 4 port of VTE as a terminal widget. While a lot of progress has been made on this port, copying has yet to be implemented. This means there's currently no way to copy text in %s.
fi: %s käyttää varhaista GTK4 versiota VTE pääteenä. Vaikka paljon edistystä on saavutettu, kopiointia ei ole toteutettu. Tämä tarkoittaa ettei ole mahdollista kopioida tekstiä %s ohjelmaan.

source: Fullscreen
fi: Kokoruutu
th: เต็มจอ

source: Preferences
fi: Asetukset
th: การตั้งค่า

source: Keyboard Shortcuts
fi: Näppäinoikotiet
th: คีย์ลัด

source: About
fi: Tietoja

source: Menu
fi: Valikko

source: Enter new shortcut
fi: Lisää uusi oikotie

source: Enter new shortcut for "%s"
fi: Lisää uusi oikotie kohteeseen "%s"

source: Focus Next Tab
fi: Valitse Seuraava Välilehti

source: Focus Previous Tab
fi: Valitse Edellinen Välilehti

source: New Window
fi: Uusi Ikkuna
th: หน้าต่างใหม่

source: Toggle Header Bar
fi: Kytke otsikkopalkki

source: New Tab
fi: Uusi Välilehti
th: เปิดแท็บใหม่

source: Copy
fi: Kopioi
th: คัดลอก

source: Paste
fi: Liitä
th: วาง

source: Search
fi: Etsi
th: ค้นหา

source: Zoom In
fi: Suurenna
th: ซูมเข้า

source: Zoom Out
fi: Pienennä
th: ซูมออก

source: Reset Zoom
fi: Palauta alkuperäinen koko

source: Close Tab
fi: Sulje Välilehti

source: Switch to Tab %u
fi: Siirry välilehteen %u

source: Switch to Last Tab
fi: Siirry viimeiseen välilehteen

source: Show headerbar
fi: Näytä otsikkopalkki

source: No tabs open
fi: Ei avoimia välilehtiä

source: Terminal Font
fi: Päätteen fontti
th: ฟอนต์เทอร์มินัล

source: Show app version
fi: Näytä ohjelman versio

source: Set current working directory
fi: Aseta nykyinen työskentelykansio

source: Execute command in a terminal
fi: Suorita kometo päätteessä
th: รันคำสั่งในเทอร์มินัล

source: Show help
fi: Näytä ohje

source: Run %s --help to get help
fi: Aja %s --help nähdäksesi ohjeen
